

###### Statistics in R ----------------------------------------

#################################### 1- آمار توصیفی ########################################

## Frequency Table --------------------

# Packed_Data.txt
setwd("C:/Users/saman/Desktop")
c<-read.table(choose.files(),header = T)
head(c) 
tail(c)


## Ungroup Frequency : فراوانی غیر گروهی
table(c)

## Group Frequeny : داده ها در رنجهای خاص گروه بندی شده اند
## سهولت در تصمیم گیری

range(c)
low_val<-148.5
high_val<-151
step_val<-0.5  # فاصله بین داده ها


c_breaks<-seq(low_val,high_val,step_val) # seq : Sequence = توالی ایجاد میکنیم 
c_breaks

# cut : breaks to range of data : نمایش حدود بازه ها
x<-cut(c$Weight,c_breaks)
x
c  # compare it with x

# Frequency : بازه را نمایش بده
table(x)

# دیتا فریم ایجاد میکنیم
# as.data.frame = تابع ایجاد دیتا فریم
Freq_table<-data.frame(table(x))
Freq_table

# یک ستون جهت نمایش درصد ایجاد می کنیم 
# round: Function to round decimal
Freq_table$percentage<-round(Freq_table$Freq,1)/sum(Freq_table$Freq)*100
Freq_table

# نمایش درصد تجمعی :
#cumml= cumulative
#cumsum = مقادیر متناظر تجمعی را نمایش میدهد
Freq_table$cumml<-cumsum(Freq_table$percentage)
Freq_table
#--------------------------------------------------------

##### Data Visulization ---------------------------------------------------


## Histogram --------


hist(c$Weight,breaks = 12,col = "Red",xlim = c(148.5,151),
     ylim = c(0,15),xlab = "weight(gram)",main = "Histogram")


##  سوال : خروجی کدهای زیر ؟

hist(c$Weight,breaks = 5,col = "Blue",xlim = c(148.5,151),
     ylim = c(0,25),xlab = "weight(gram)",main = "Histogram")


## Plot -----------

plot(table(x),ylim = c(0,25),xlab = "Weight",ylab = "Frequency",type = "b")


## Boxplot --------------

boxplot(c$Weight)
boxplot(c$Weight,main="Box Plot")


## Simple Pie chart -----------

# مثال : داده های جدید می سازیم
# داده های گسسته

numbers<-c(50,70,20,30,80)
category<-c("A","B","C","D","E")

pie(numbers,labels = category,main = "Pie Chart")


## Bar chart ------------------

barplot(numbers,names.arg = category,xlab = "Product",ylab = "Frequency",col = "Blue")

#names.arg : برچسب های محور ایکس از روی ستون Category خوانده شود
#----------------------------------------------------------------------------------------

### شاخصهای مرکزی ----------

# Mean & Median & quantile :

mean(c$Weight)     # میانگین
median(c$Weight)# میانه
quantile(c$Weight) # چارک


#
GetMode <- function(x) {
  u <- unique(x) # unique = calculate duplicate element
  u[which((tabulate(match(x,u)))== max((tabulate(match(x,u)))))]
}

GetMode(c$Weight)



### شاخصهای پراکندگی -----------------
# Range , IQR , Variance, Standadr Deviation, CV ---------------

range(c$Weight)               # کوچکترین و بزرگترین داده 

max(c$Weight)-min(c$Weight)  # دامنه

IQR(c$Weight)               # ( Q3-Q1 ) فاصله بین چارکی

var(c$Weight)    # واریانس
sd(c$Weight)     # انحراف معیار


## واریانس جامعه آماری

varp<-function(x){
  mean((x-mean(x))^2)
}

varp(c$Weight)




##  coefficient of variation :  CV : ضریب تغییرات
# cv = sd/mean
cv<-sd(c$Weight)/mean(c$Weight)
cv*100



## Skewness & Kurtosis : ضریب چولگی و شکستگی --------------------------------------

# نصب پکیج ذیل ------------------- 
# Install pakage " moment "
# Library = فراخوانی پکیج
install.packages("moments")
library(moments)

#---------------------------------

# تذکر  : مقدار ضریب چولگی برای تابع توزیع نرمال صفر است
skewness(c$Weight) # ضریب چولگی

# تذکر : مقدار ضریب شکستگی برای تابع توزیع نرمال سه است
kurtosis(c$Weight) # ضریب شکستگی


# محاسبه ضریب چولگی تابع توزیع نمونه بدون فرض نرمال بودن
n<-nrow(c)
n
# ابتدا یک اندازه نمونه میسازیم
# sample size= برابر با تعداد ردیف های دیتا فریم  در نظر میگیریم

kurtosis(c$Weight)-3*((n-1)^2/(n-2)*(n-3))


# رسم هیستوگرام بر اساس چگالی :  
# freq=F : density
hist(c$Weight,breaks = 5,freq = F,col = "Red",xlim = c(148.5,151.5),
     main = "Histogram with NormalCurve")


# فرض کنیم داد های فوق از حالت نرمال پیروی می کند
# میخواهیم ببینیم تابع توزیع نرمال به چه شکلی است
# سه خط کد ذیل را وارد می کنیم

# seq = رنج اعداد تولیدرا تعیین می کند
# length = فاصله بین داده ها
xfit<-seq(148.5,152,length=40)
xfit
# dnorm = تابع توزیع نرمال با میانگین و انحراف معیار
yfit<-dnorm(xfit,mean = mean(c$Weight),sd=sd(c$Weight))

#lwd : ضخامت نمودار
lines(xfit,yfit,col="Blue",lwd=2)


#-------------------------------------------------------------------------------------------


############################ 2- Probability & Distribution ################################


########## Discrete Dist : توزیع های گسسته : ---------------------------


### حل مسائل توزیع احتمال دوجمله ای -----------------------------------------------------
### Bionominal Dist.

## Example :حل مساله توزيع احتمال دو جمله اي : ---

# فرض مساله
p<-20/100   # احتمال موفقيت
n<-12       # تعداد حالتهاي مورد آزمايش
r=0
## سوال اول :Probability of no sales ( P(X=0)) : هيچ فروشي نداشته باشد --------------------------------
# r=X=0 تعداد حالتهای موفق 

# dbinimial : احتمال وقوع پیشامد

dbinom(0,n,p) # n : آزمایش دوازده بار تگرار شود


## سوال دوم : B :Probability of exactly 2 sales ( P(X=2)): دقيقا دو فروش داشته باشد---------------------

# r= X=2 دقيقا دو فروش داشته باشد
# n=12 :تعداد حالتهاي مورد آزمايش
# p= 0.2 حالت موفقيت
dbinom(2,n,p)

## سوال سوم :  max 2 sales ( P(X<=2)) حداکثر دو فروش داشته باشد --------------------------------------

# ( P(X<=2) or X=0, X=1 , X=2 مجموعه ای از چند رخداد
# در اينجا احتمال تجمعي يا احتمال مجموعه اي از رويدادها را حساب ميکنيم

# راه حل اول : -----
# 
# X=0,1,2 هر کدام را مقدار داده و جمع مي کنيم
(dbinom(0,n,p)+dbinom(1,n,p)+dbinom(2,n,p))

# راه حل دوم : --------
# X=2 حداکثر دو فروش داشته باشد
# n=12
# p=0.2


pbinom(2,n,p,lower.tail = TRUE)
# pbinom :  تابع احتمال تجمعی
# lower.tail=TRUE : نشان دهنده کوچکتر مساوی


## سوال چهارم : ( P(X>=2)) : احتمال اينکه حداقل دو فروش داشته باشيم 

#راه حل اول ---------
#  همه حالتها به غیر از صفر و یک

1-(dbinom(0,n,p)+dbinom(1,n,p))

# راه حل دوم ---------
#X=1
pbinom(1,n,p,lower.tail = FALSE)
# lower.tail=FALSE : نشان دهنده بزرگتر مساوی
# n=12
# p=0.2

####### حل مساله توزیع فوق هندسی ----------------------------------------------------------------------
## Hypergeometric Dist.

# Example :

N<-200    # اندازه جمعیت
n<-30     # تعداد نمونه
p<-0.05   # درصد قطعات معیوب
r<-0      # موفقیت به این معنی که هیچ معیوبی نباشد

## Probability of no defect (P(x=0) : احتمال اینکه هیچ قطعه معیوبی مشاهده نشود


dhyper(r,p*N,(1-p)*N,n)

# dhyper = Function for Hypergeometric probabilty
# r= 0, x=0  میزان رخداد صفر است
# p*N= 0.05*200 تعداد نمونه های موفق یا همان تعداد قطعات معیوب
#(1-p)*N= (1-0.05)*200 = تعداد عدم موفقیت در جمعیت یعنی تعداد سالم ها
# n = تعداد نمونه ای که از جمعیت محدود می گیریم



###### حل مساله توزیع هندسی ------------------------------------------------------------------
## Geometric Dist.

# Example :
# در این مساله نیز موفقیت را تولید قطعه معیبوب  در نظر میگیریم: 

p<-0.03  # احتمال موفقیت
x<-100   # حصول موفقیت بعد از صد بار

## Probability that first sucess will be the 100th part
## احتمال موفق در صدمین قطعه یا همان مشاهده معیوب

dgeom(x,p)


##### حل مساله توزیع پواسون -----------------------------------------------------------------
# Poisson Dist.

# Example : 
#فرض کنید یک چهارراه دارای نرخ تصادف میانگین 5 تصادف در هر ماه است
#فرض شود تعداد تصادفات از توزیع پواسن پیروی می کند
#احتمال آنکه سه تصادف در یک ماه در این چهار راه رخ دهد چقدر است؟
#احتمال آنکه 5 تصادف یا بیشتر در یک ماه در این چهارراه رخ دهد چقدر است؟

# lambda = لاندا یا امید ریاضی
# میانگین پنج تصادف در هر ماه
lambda<-5


## سوال 1 ) Probability of 3 accidents احتمال سه تصادف در یک ماه -----------------------------
dpois(3,lambda)
# d = احتمال مشخص
# pis = تابع توزيع پواسون
# X=3 :  تعداد رخدادها


## سوال 2 ) Probability of at least 5 accident احتمال پنج تصادف یا بیشتر در یک ماه -------------

ppois(4,lambda,lower.tail=F)
# ppoint= تابع تجمعی
# lower.tail=F : بزرگتر یا مساوی



## آزمون استفاده از توزیع پواسون --------------------------------------------------------------
## Poisson Test :

# Example :

# Data Frame : Times down data frame

setwd("C:/Users/saman/Desktop/Statistics and Regression with R/Data Frames") 

data<-read.table("TimesDown.dat",header = T)

head(data)
tail(data)
table(data$TimesDown)
mean(data$TimesDown)


## آزمون فرضيه : -------------------------------------------

## فرض ميشود چنانچه داده هاي ما از توزيع پواسون پيروي کنند ميانگين آن چه عددي برآورد شود؟

## poission.test = تابع تست توزیع پواسون
poisson.test(x=sum(data$TimesDown),T=length(data$TimesDown))  # show in cons
# X = تعداد رخدادها در بازه زمانی مورد نظر
#T= length(data$TimesDown) : بازه زمانی رخدادها را مشخص می کنیم
# یا
# T=31  بازه زمانی یکماهه
##نتایج آزمون نشان میدهد آیا داده ها از توزیع پواسون پیروی می کنند یا خیر


## حال احتمالات را بر اساس توزیع پواسون بدست می آوریم :


# سوال 1 : X>=2 احتمال اینکه در یکروز دو خرابی یا بیشتر داشته باشیم -----------------------

ppois(1,mean(data$TimesDown),lower.tail = F)


## سوال 2 : X=0 احتمال اینکه در یک سیستم با خرابی مواجه نشو -----------------------------

dpois(0,mean(data$TimesDown))


############# Continious Dist : توابع توزیع پیوسته : ------------------------------------------------


## تابع توزیع نرمال استاندارد ----------------------------------------------------------
## Normal Dist.

## Example :
#فرض کنید یک جامعه آماری دارای میانگین 5 و انحراف معیار 10 است
# با چه احتمالی متغیر تصادفی بین میانگین و عدد 6.2 قرار می گیرد؟

# فرض :

#mean=5
#std=10
# X=6.2

## روش اول : ------------------------------------
pnorm(6.2,mean = 5,sd=10,lower.tail = TRUE)-pnorm(5,mean = 5,sd=10,lower.tail = TRUE) # console
# pnorm = تابع توزیع نرمال تجمعی
# تابع احتمال تجمعی توزیع نرمال استاندارد
# Pnorm = بطور پیش فرض دارای میانگین صفر و انحراف معیار صفر است


## روش دوم :------------------------------------
## روش نرمال استاندارد

#mean=0
#std=1
# X=0.12 =  (X-mean)/std نرمال استاندارد
pnorm(0.12)-0.5     # console



### Test for Normality : آزمون نرمال بودن توزیع ---------------------------------------------------------


## Example :

# 1st : Create dataset
# ابتدا یک  دیتا ست می سازیم

# ابتدا دو نمونه تصادفی با توزیع نرمال و غیر توزیع نرمال می سازیم
set.seed(200)

# توزیع نرمال : ----
x1 <- rnorm(100, 1.5, 1.8)    # console
mean(x1)

# فرضیات
# mean=1.5
# sd = 1.8
# sample = 100

# توزیع غیر نرمال :--- 
set.seed(200)

x2 <- rweibull(100,1,1.5)
mean(x2)
# فرضیات :
# rweibull = تابع توزیع ویبول


## اجرای گامهای آزمون نرمال بودن توزیع :------------

## 1 ) گام اول رسم هیستوگرام :------
#Histogram : 

# 1-1 : توزیع نرمال : ----------------
hist(x1, probability = T, breaks = 15)
# Probabity=T نمایش توزیع چگالی

# رسم منحنی برازش بر روی هیستوگرام
lines(density(x1), col = "red")
# Density= تابع چگالی جهت برازش

## نتیجه : داده ها از توزیع نرمال پیروی میکنند


# 1-2 : توزیع غیر نرمال - ویبول :-------------
hist(x2, probability = T, breaks = 15)
lines(density(x2), col = "red")

# نتیجه : 
# X2 :  از توزیع نرمال استفاده نمیکند


### 2 ) گام دوم : رسم منحنی چارک به چارک -----------------------------------
#QQ-plot  : Quantile to Quantile Plot رسم منحنی

# 2-1 : منحنی چارک به چارک برای توزیع نرمال
qqnorm(x1, main = "QQ Plot of x1", pch = 20)


## رسم خط نرمال بر روی نمودار رسم شده :
qqline(x1, col = "red")


# 2-2 : منحنی چارک به چارک برای توزیع ویبول
qqnorm(x2, main = "QQ Plot of x2", pch = 20)
qqline(x2, col = "red")


### گام سوم : آزمون های آماری -----------------
## < 0.05 رد فرض نرمال بودن
#Good for sample size آزمون های برازش توزیع نرمال 

# آزمون اول : آزمون  " شاپیرا ویلک "  آزمون فرضیه اول --------
#Shapiro-Wilk Test for Normality

##Shapiro-Wilk:  سنجش نرمال بودن داده ها :
#p-value 
#<= 25

#1
shapiro.test(x1)            # console : p-value
#P-value= 0.1279 > 0.05, بنابر این نمیتوانیم فرض را رد کنیم

#2
shapiro.test(x2)
#P-value= 7.887e-09 < 0.05 فرضیه را رد می کنیم چون عدد پی مقدار بسیار کوچک است


## نکته : چون نمونه داده ها بیشتر از بیست و پنج است دو آزمون درگر انجام میدهیم



###### گام چهارم : Test for Skewness and Kurtosis آزمون چولگی و آزمون شکل ---------------------
##Good for sample size > 25

install.packages("moments")

# library= پکیج را فراخوانی میکنیم
library(moments)

# 1
## آزمون ضریب چولگی --------------------------------------------------------------------------------
# آزمون " جارک - برا"   و:
#Jarque-Bera Test (Skewness = 0 ?) آیا ضریب چولگی برابر با صفر است؟
#p-value < 0.05 reject normality assumption

# Jarque.test = Function to test skewness
jarque.test(x1)   # console

jarque.test(x2)   # console

# 2
## آزمون ضریب کشیدگی ------------------------------
## میدانیم در توزیع نرمال ضریب کشیدگی = 0
#Anscombe-Glynn Test (Kurtosis = 3 ?) آیا ضریب کشیدگی برابر سه است؟
#p-value < 0.05 reject normality assumption


# anscombe= Function to 
anscombe.test(x1)   # console

anscombe.test(x2)   # console

## نتیجه داده های تابع توزیع دوم از توزیع نرمال تبعیت نمی کنند


####    Transform to Normal Dis--------------------------------------------------------------------
##      تبدیل به توزیع نرمال


# X2 : از نمونه مساله قبل که از توزیع ویبول پیروی می کرد استفاده می کنیم
# جذر 
# X>0 = شرط اول
# min(X2)>0


# یکبار با روش جذر تمام پنج گام آزمون رو انجام میدهیم
# x2_trans <- sqrt(x2)
# یکبار با روش لوگاریم تمام پنج گام آزمون را انجام می دهیم
# x2_trans <- log(x2)

# Step 1 : sqrt
x2_trans <- sqrt(x2)  # "state"  with sqrt
mean(x2_trans)

# Setep 2
x2_trans <- log(x2)  # " state"  with log
mean(x2_trans)

## اجرای گامهای آزمون نرمال بودن توزیع :------------

# گام اول رسم هیستوگرام :----------
hist(x2_trans, probability = T, breaks = 15)
lines(density(x2_trans), col = "red")  # compare with last histogram 

# مقایسه مثال قبل که منحنی از توزیع نرمال تبعیت نمیکرد
hist(x2, probability = T, breaks = 15)
lines(density(x2), col = "red")
#-------

# گام دوم : منحنی چارک به چارک

qqnorm(x2_trans, main = "QQ Plot of x2_trans", pch = 20)
qqline(x2_trans, col = "red")



# گام سوم : آزمون شاپیرو -------------------
#Shapiro-Wilk : 

#p-value < 0.05 reject normality assumption
#Good for sample size <= 25
shapiro.test(x2_trans)


## حال مراحل فوق را برای حالت لگاریم اجرا میکنیم
## نتایج دو حالت با هم مقایسه گردد




# گام چهارم : آزمون ضریب چولگی -----------------
#Skewness :

#Good for sample size > 25
#Jarque-Bera Test (Skewness = 0 ?)
#p-value < 0.05 reject normality assumption
jarque.test(x2_trans)


# گام پنجم : آزمون ضریب کشیدگی : ---------------
#Anscombe-Glynn Test (Kurtosis = 3 ?)
#p-value < 0.05 reject normality assumption
anscombe.test(x2_trans)


## Homework : -------------
# test for X^3 :
x2_power3 <- x2 ^ 3
hist(x2_power3, probability = T, breaks = 15)
lines(density(x2_power3), col = "red")


qqnorm(x2_power3, main = "QQ Plot of x2_power3", pch = 20)
qqline(x2_power3, col = "red")

shapiro.test(x2_power3)

jarque.test(x2_power3)

anscombe.test(x2_power3)

######## تقریب تابع توزیع دو جمله ای با استفاده از توزیع نرمال ##  ----------------------


# فرض مساله : --------------------------------------
n<-10                 # تعداد آزمایشات
p<-0.5                # احتمال موفقیت
m<-n*p                # میانگین
s<-sqrt(n*p*(1-p))    # انحراف معیار

# 1 ) P(X=5) : محاسبه احتمال توزیع دو جمله ای - نوزیع گسسته -----
dbinom(5,n,p)

## روش تقریب توزیع نرمال
# 2 ) محاسبه احتمال توزیع نرمال - توزیع پیوسته 

# در اینجا احتمال در یک بازه قرار دارد : 
# X=5
# P(4.5 <= X => 5.5 ) 

pnorm(5.5,m,s)-pnorm(4.5,m,s)

# -------------------------------------------------------------------------------------------------

## Exponential Dist. تابع توزیع نمائی  ------------------------- 

# طبق بررسی صورت گرفته، میانگین فاصله بین زمان های خرابی یک سرور کامپیوتری 100ساعت است
# اگر فرض شود که فاصله زمانی بین خرابی ها از توزیع نمایی پیروی کند
# با چه احتمالی این سرور برای حداقل 50  ساعت متوالی به کار خود ادامه خواهد؟

#  میخواهیم احتمال اینکه بیش از پنجاه ساعت متوالی به کار خود ادامه دهد بدست آوریم

pexp(50,1/100,lower.tail = F) # console
# exp= Exponential Function
# q=50
# rate = 1/mean = 1/100
# lower.tal= False زیرا بزرگتر از پنجاه را بررسی می کنیم


## Test for Exponentiality-----------------------------------------------------------
## آزمون توزیع نمایی ---------------------

## Shapiro -Wilk : آزمون شاپیرو ویلک

# برای آزمون دو دیتاست مختلف می سازیم
# Create dataset

# 1  ) Exponential Dist : تابع توزیع نمائی ----------
# تایع توزیع نمایی
set.seed(200)
x1 <- rexp(100)
mean(x1)

# 2 ) Non-exponential Dits : تابع توزیع غیر نمایی -----------

# chisq= توزیع کای - دو
set.seed(200)
x2 <- rchisq(100,1)
# df=1
mean(x2)

## گام اول : Histogram -------

hist(x1, probability = T, breaks = 15)

hist(x2, probability = T, breaks = 15)


## گام دوم : Shapiro-Wilk Test
# آزمون شاپیرو ویلک

# نصب پکیج : 
install.packages("exptest")
library("exptest")


# shapiro.exp.text : Function
#1:


shapiro.exp.test(x1)  # console , p-value result


#2:
shapiro.exp.test(x2)  # console , p-value result


# نتیجه : داده های دوم از توزیع نمائی پیروی نمی کنند



########################### 3- توزیع نمونه گیری ###########################################

## Central Limit Theorem تئوري حد مرکزي  ----------------------------------------

## ابتدا یک جمعیت آماری می سازیم و سپس نمونه های سی تایی  از آن میگیریم:
# "uniform" dist: در اینجا یک توزیع غیر نرمال بنام توزیع یکنواخت از جمعیت میسازیم
# توزیع یکنواخت : احتمال وقوع هر یک از اعداد  با هم برابر است

# 1 ) 
# population = 10000 جمعیت
# تعداد ده هزار اعداد تصادفی بین اعداد صفر و یک تولید می کنیم
# min=0 , max=1 فرضد می کنیم اعداد بین صفر و یک توزیع می شوند

set.seed(1234)
pop <- runif(10000, min=0, max=1)
hist(pop,main = "Dist. of Population")   # hist analysis
# runif= تابع توزیع یکنواخت
# در اینجا اعداد بصورت یکسان به افراد تخصیص داده شده است

## 2)  500 Sample of size 30 : از جمعیت 500  بار نمونه سی تایی میگیریم

## 2-1 ) ابتدا یک دیتا فریم خالی می سازیم
sample_dist <- data.frame(matrix(nrow=500,ncol = 30))


# 2-2 ) دیتا فریم را با  استفاده از حلقه با داده های نمونه برداری شده پر می کنیم : 
for (i in 1:500) {
  sample_dist[i,] <- sample(pop,30)
}

# i= 1:500  یعنی قرار است پانصد بار نمونه برداری اتفاق بیافتد
# sample =  تابع نمونه گیری تصادفی
# sample(pop,30)=  نمونه هائی که از جمعیت گرفته میشود 
# در هر ردیف سی عدد تصادفی انتخاب شده
head(sample_dist)  # cons

## 3 ) بر روی هر ردیف میانگین نمونه ها را میگیریم :

sample_dist[,'Mean'] <- rowMeans(sample_dist[,c(1:30)])
head(sample_dist)
# sample_dist[,"Mean]= ستون میانگین را به دیتا فریم اضافه می کنیم

## حال پیش بینی قضیه حد مرکزی را مقایسه میکنیم
# میخوتاهیم ببینیم میانگین جامعه با میانگین نمونه برابر است؟


# محاسبه میانگین توزیع یکنواخت جامعه
mean_pop <- (1+0)/2      # حد بالا باضافه حد پائین تقسیم بر دو
mean_pop     # show in con

## محاسبه واریانس توزیع یکنواخت
# Var= کرانه بالا منهای کرانه پائین تقسیم بر  دوازده

# Variance Formula : max-min^2/12
var_pop <- (1-0)^2/12     # show in con

# در قضیه حد مرکزی واریانس باید تقسیم بر تعداد نمونه ها شود
# var=var/n
#n=30
var_pop/30

### حال با پیش بینی حد مرکزی مقایسه می کنیم : 

#1 :  توزیع میانگین را بر روی منحنی می بینیم
#Dist. of Sample Means
hist(sample_dist$Mean, main = "Dist of Sample Means", breaks = 20)# توزیع میانگین ها متقارن شد

#2 : میانگین توزیع میانگین
mean(sample_dist$Mean)
mean_pop <- (1+0)/2  # میانگین جامعه حد مرکزی
mean_pop
#3 : انحراف معیار توزیع میانگین
var(sample_dist$Mean)
var_pop/30 # انحراف معیار جامعه حد مرکزی

#------------------------------------------------------------------------------------

############################# 4 - برآورد نقطه ای و و بازه ای ###################################

# مثال- 1 : برآورد بازه ای میانگین ------------------------------

# انحراف معیار جامعه که دارای توزیع نرمال است10 است. یک نمونه 25 تایی از این 
# جامعه گرفته میشود که میانگین نمونه برابر 50 است. یک بازه اطمینان 95 % برای میانگین
# تعیین کنید :

# آلفا = 0.05
# آلفا دوم = 0.025
qnorm(0.025)



## مثال 2 : برآورد بازه ای میانگین --------------------------------
## واریانس نامعلوم
## t-student = توزیع تی

## یک جامعه که دارای توزیع نرمال است. یک نمونه 25 تایی از این جامعه گرفته میشود که
# میانگین نمونه برابر 50 و انحراف معیار آن 8 است. یک بازه اطمینان 95 % برای میانگین جامعه
# تعیین کنید

# Var = واریانس جامعه = نامعلوم
# n=25 , n-1=24
qt(0.025,24)




## مثال 3 : برآورد بازه ای واریانس ---------------------------------
## توزیع کای-دو

# یک نمونه 14 تایی از یک جامعه گرفته میشود. واریانس این نمونه 12.65 است. یک بازه
# اطمینان 95 % برای واریانس جامعه تعیین کنید.

# حد پائین
# 1- (0.05/2) = 0.975 
# df= درجه آزادی
qchisq(0.975,df=13)

# حد بالا
# 0.05/2=0.025
# df= درجه آزادی
qchisq(0.025,df=13)


## --------------------------------------------------------------------------
## مثال 4 : برآورد بازه ای نسبت

# در یک نمونه 65 تایی از یک جامعه میزان نسبت در نمونه 33 درصد است. یک بازه اطمینان
# 99 % برای نسبت در جامعه تعیین کنید

# 0.01/2=0.005 = مقدار آلفا دوم
qnorm(0.005)



################################ 5- آزمون فرضیه  ###############################################

###  Hypothesis testing----------------------------------------------------------------

## One sample mean when population variance is known-------------
## آزمون فرضیه برای میانگین یک جامعه
## واریانس جامعه مشخص است : 

## چون تعداد نمونه بزرگ است فرض نرمال بررسی --------------


## نوجوانان پسر در یک سن مشخصی دارای میانگین وزن 43 کیلوگرم هستند
# این نگرانی در یک جامعه محلی وجود دارد که نوجوانان پسر در آن سن از کمبود وزن رنج می برند. 
#  یک نمونه 30 تایی از این نوجوانان پسر گرفته می شود که میانگین وزن شان 40.4 کیلوگرم است
# اگر فرض کنیم انحراف معیار جامعه 5.8 کیلوگرم است، آیا این نگرانی باید جدی گرفته شود؟


## مراحل هفت گانه آزمون فرض :

# 1 ) H0 => 43 فرضیه صفر
# 2 ) H1<43 فرضیه جایگزین
# 3 ) alpha=0.05 مقدار آلفا
# 4 ) Data collection : جمع آوری داده
# 5 ) Statistics : محاسبه آماره
# 6 ) P-Value = تعیین ناحیه رد فرضیه
# 7 ) Result = نتیجه گیری

# آماره آزمون توزیع نرمال
# واریانس مشخص
# میانگین یک جامعه
# z = (xbar-mu)/(var/sqrt(n))     فرمول آماره توزیع نرمال یک جامعه با واریانس مشخص

## گام یک تا چهار
xbar <- 40.4                          # sample mean میاننین ممونه
mu <- 43.0                            # hypothesized value میانگین فرض شده
sigma <- 5.8                          # population standard deviation واریانس جامعه
n <- 30                               # sample size تعداد نمونه

## گام پنج : محاسبه آماره آزمون -------------------
z <- (xbar-mu)/(sigma/sqrt(n))        # test statistic آماره آزمون
z   # console

## گام شش : تعیین ناحیه فرض صفر --------------------

## روش اول : تعیین آماره آلفا
# مقایسه مقدار آماره با مقدار توزیع نرمال استاندارد
alpha = .05 
z.alpha <- qnorm(alpha) # معادل سطح زیر نمودار آلفا  
z.alpha   # show in console : -1.644854

# آماره آزمون در ناحیه رد فرضیه صفر قرار گرفته است
# دانش آموزان از کمبود وزن رج میبرند


## P - Vaulue : روش دوم : تعیین مقدار پی ولیو
# محاسبه احتمال وقوع آماره : 
# pnorm(z) = 
pval<-pnorm(z)                      # p-value , lower tail 
pval  # 0.007038196 :  

# Pavalue<0.05 Null H reject


##  7 : نتیجه : آزمون صفر رد می شود

## بر اساس نمونه های گرفته شده میبایست نگران باشیم که افراد از کمبود وزن رنج می برند


## One sample mean when population variance is unknown -------------------------------------------
## آزمون فرضیه برای میانگین یک جامعه
## واریانس جامعه نامشخص است : 
## اندازه نمونه بزرگ تر از سی است  پس فرض نرمال بودن توزیع نرمال 

# مثال : 
# اینطور فرض میشود که میانگین فشار خون بیشینه افراد روی 120 میلی متر جیوه است
# مدیران سلامت یک شهر دائما وضعیت فشار خون شهروندان را پایش می کنند
# میانگین فشار خون بیشینه در یک نمونه 100 نفری از جمعیت آن شهر
# 130.1 
#   با انحراف معیار 21.21 میلیمتر جیوه است است
# آیا می توان ادعا کرد شهروندان این شهر دارای فشار خون متفاوتی از جمعیت کل جامعه هستند


# محاسبه آماره آزمون
xbar <- 130.1                          # sample mean : میانگین نمونه
mu <- 120.0                            # hypothesized value : میانگین فرض شده
sd <- 21.21                            # Sample standard deviation : انحراف معیار نمونه
n <- 100                               # sample size 
t <- (xbar-mu)/(sd/sqrt(n))            # test statistic : فرمول آزمون آماره t
t  # 4.761905    آماره آزمون

## تعیین ناحیه رد فرضیه صفر

alpha <- .05                          # مقدار آلفا
df <- n-1                             # df = n-1 :درجه آزادی
# در این مثال با حالت دو طرفه مواجه هستیم
# مهم برای ما اینست که میانگین مفروض = 120 
# 0.05/2 : چون دو طرقه است تقسیم بر دو میکنیم
# half.alpha< lower.limit : مقدار آلفا کوچکتر از حد پائین
# half.alpha> Upper.limit : مقدار آلفا بزرگتر از حد بالا

# محاسبه حد بالا
t.half.alpha <- qt(1-alpha/2, df)     # upper.limit = (1-alpha)/2  حد بالا,qt= تابع محاسبه t
c(-t.half.alpha, t.half.alpha)       # console # چون متقارن هستند با محاسبه یکی دیگری تعیین می شود 
# -1.984217  1.984217 :
## حال بررسی می کنیم آیا آماره آزمون در این دو ناحیه هست یا خیر؟
t.half.alpha

## مقدار آماره خارج از بازه فوق بود و فرض صفر رد می شود


## رویکرد محاسبه P-Value
pval <- 2*pt(-t,df) # احتمال وقوع آماره  # p-value , two-tail  تابع توزیع t
# 2*pt : two tail
pval
# -t = چون سطح زیر نمودار هر دو طرف یکی است، هرکدام را محاسبه کنیم با هم برابر است

## 6.562702e-06  مقدار P-value بسیار کوچک ااست و فرض صفر رد می شود

#------------------------------------------------------------------------------------------------
###################################################################################
## مثال
## انجام آزمون فرض بدون محاسبات دستی و با استفاده از توابع
## آزمون فرضیه برای میانگین با استفاده از آزمونT
## T-test---------------------

# مثال :

# یک دستگاه تزریق پلاستیک برای تولید یک قطعه جدید به تازگی بازتنظیم شده است. مطابق با
# نیاز طراحی قطر قطعات پلاستیکی باید 0.7730 اینچ باشد. پس از راه اندازی دستگاه 50 نمونه
# قطعه تولید و قطر آنها اندازه گیری می شود
# آیا این دستگاه مطابق هدف طراحی تولید می کند؟


# استفاده از دیتا فریم : 
setwd("C:/Users/gsstech/Desktop") 
data <- read.table("PlstCase.dat", header = T)
data

# در اینجا آزمون فرض ما دو طرفه است یعنی بزرگتر و کوچکتر از  عدد میانگین فرض شده مطلوب نیست


mu0 <- 0.7330          # میانگین مطلوب یا همان میانگین جامعه
# Ho: mu = mu0          #مقدار فرض صفر
# H1: mu # mu0          #فرض دوم
# one sample t-test     # یک نمونه برای انجام آزمایش t
# p-value = 0.05        # مقدار معین

t.test(data$size, mu = mu0, alternative = "two.sided", conf.level = 0.95)  # consol analysis
# t.test                # تابع آزمون تی
# mu=m0                 # میخواهیم حالت فرضیه داده ها با حالت فرض صفر مقایسه شود
# alternative           # تعیین می کنیم آزمون یک طرفه است یا دو طرفه، پیش فرض دو طرفه است
# conf.level: Confidence level :  = 0.95     # پیش فرض نود و پنج درصد است

## alternative hypothesis: true mean is not equal to 0.733 : فرضیه رقیب

## p-value > 0.05 = نمي توانيم فرض صفر را رد کنيم


#----------------------------------------------------------------------------------------------------

### آزمون فرضیه برای میانگین دو جامعه
### Two-sample mean---------------------

## مثال : عملکرد پرسنل پاسخگوی یک شرکت خدمات پس از فروش :----------------


# عملکرد دو متصدی مرکز تلفن یک  خدمات پس از فروش به منظور ارزیابی سرعت در پاسخ گویی به مشتریان بررسی شده است
# اطلاعات نمونه 15 تایی از عملکرد هر یک از این دو متصدی بر حسب ثانیه اندازه گیری شده است
#آیا می توان ادعا کرد بین عملکرد این دو متصدی بر حسب سرعت پاسخگویی، تمایز معنی داری وجود دارد؟
#SALES.dat Data Frame

# Read data from file                         # حاوی نمونه پانزده تایی از عملکرد دو متصدی
setwd("C:/Users/saman/Desktop")
data <- read.table("SALES.dat", header = T)

data

# داده های دو متصدی را از هم جدا میکنیم
c1<-data$time[data$clerk==1]
c1
c2<-data$time[data$clerk==2]
c2


## چون تعداد داده ها کوچکتر از سی است میبایست نرمال بودن توزیع را چک کنیم : -----
## sample size < 30

# Shapiro-Wilk Test for Normality               # آزمون شاپیرو ویلک رای نرمال بودن
# H0 : data normally distributed                # فرض صفر : نرمال بودن
# p-value < 0.05 reject normality assumption    # کمتر از پنج صدم فرض نرمال بودن رد می شود
shapiro.test(c1)   # فرض نرمال بودن توزیع
shapiro.test(c2)   # فرض نرمال بودن توزیع


## t-test for two-sample mean                   # آزمون تی برای دو میانگین نمونه

#Equal variance?                              # ابتدا بررسی می کنیم آیا وراریانس ها با هم برابرند؟
#H0: variances are equal                      # فرض صفر : واریانسها با هم برابرند
#H1: variances are not equal                  # واریانس ها با هم برابر نیستند
#p-value < 0.05 reject equality of variances  # رد فرض صفر اگر کمتر از پنج صدم باشد
var.test(c1,c2)                               # p- value result                     
# var.test= آزمون نمونه را بر روی واریانس ها برقرا می کند

# p-value > 0.05 : در نتیجه فرض رد نمیشود و واریانس ها با هم برابرند


## حال آزمون برابری میانگین دو جامعه را انجام می دهیم : t-Test --------------
#Equal mean=?

# H0: means are equal                         # فرضیه صفر : میانگین دو جامعه برابرند
# H1: means are not equal                     # فرضیه مقابل: میانگین ها با هم برابر نیستند
#p-value < 0.05 reject equality of means      # مقدار رد فرض صفر


## Two sample t-test : t.test

t.test(c1,c2 , var.equal = T, alternative = "two.sided", conf.level = 0.95)
# var.equal=T                                 # واریانس ها با هم برابرند
# conf.level = 0.95                           # سطح بازه اطمینان 

## نتیجه :
# p-value = 0.004691      # مقدار بدست آمده بسیار کوچک است
# بنابراین نمیتوان فرض کرد میانگین عملکردی این دو نفر از لحاظ سرعت با هم برابر است
# فرض صفر رد می شود




#### چنانچه فرض کنیم که آیا میانگین عملکرد نفر اول بهتر از نفر دوم است ------------
## مثال آزمون یک طرفه
##c1 is better than c2= ؟

# H0: mu1 => mu2                            # فرض صفر
# H1: mu1 < mu2 یا   (mu1 - mu2 < 0)        # فرض مقابل
#p-value < 0.05 reject equality of means

t.test(c1,c2 , var.equal = T, alternative = "less", conf.level = 0.95)
# alternative = "less" : مقدار نا معادله فرض یک کمتر از صفر است

## نتیجه :
#c1 is better than c2
# p-value = 0.002346  
# با توجه به مقدار کم پی ولیو نمیتوان قبول کرد عملکرد نفر اول از دوم بهتر است
## پس فرضیه دوم نیز رد می شود




## آزمون فرضیه برای میانگین همتا--------------------------------------------------------------------------------
## ( دو نمونه از هم مستقل نیستند)

#یک شرکت مشاوره روان شناسی صنعتی، براساس پرسشنامه ای سطح تنش روانی ( استرس) را در بین افراد شاغل سنجش می کند
#خروجی این پرسشنامه یک شاخص بین 0 تا 50 است که هرچه به 0 نزدیک تر باشد نشان می دهد سطح تنش روانی در افراد بالاتر است
#این شرکت ادعا می کند می تواند با یک دوره آموزشی فشرده یک ماهه افراد را به توانمندی برساند که آنان بتوانند با مدیریت بهتر خود سطح تنش روانی را در خود کاهش دهند
#به این منظور شاخص تنش روانی در افراد شرکت کننده در دوره آموزشی مدتی قبل از شرکت در دوره و مدتی پس از شرکت در دوره اندازه گیری شده 
#آیا براساس این داده ها می توان ادعا کرد این دوره آموزشی تغییری در تنش روانی افراد داشته است؟

#Subsequent : next result
# prior : last result
# x : indicates people
# no of people : 50
#t-test for paired-group-------------------------

# H0: mu0 - mu1 =0              # فرضیه صفر:  تفاوت میانگین ها صفر است یعنی تغییری با آموزش ایجا نمیشود         
# H1: mu0 - mu1 # 0             # فرضیه مخالف
#p-value < 0.05 reject null hypothesis

# stress.csv فایل حاوی شاخص تنش قبل و بعد
data <- read.csv("Stress.csv", header = T)
data<-read.csv(file.choose())
data

# sample size > 30                # نیاز به آزمون نرمال نیست چون نمونه بیشتر از سی است
# Paired=T                        ## دونمونه گروه همتا هستند

t.test(data$Prior,data$Subsequent, paired = T, alternative = "two.sided", conf.level = 0.95)

# alternative = "two.sided" : آزمون دو طرفه است

# نتيجه : 
## مقدار پي ولو بسيار کوچک است پس فرض صفر رد کي شود
# نتیجه تست : فرض صفر رد می شود و نمیتوانیم بگوئیم آموزش تاثیری در سطح تنش نداشته است


# میتوانی این تغییرات را در میانگین دو نمونه هم مقایسه کنیم
# بررسی ضریب تاثیر - معنی داری عملیاتی 
mean(data$Prior)
mean(data$Subsequent)



### آزمون فرضیه برای مقایسه واریانس -----------------------------------------------------------------------------
## Testing a Variance ------------------
## مثال یک نمونه آماری : 

## مثال :
# دستگاه تزریق پلاستیک برای تولید یک قطعه جدید را در نظر بگیرید. 
# آیا با توجه به داده های موجود
#می توان ادعا کرد واریانس جامعه برابر 2.4*10^06 است ؟


# EnvStats : برای آزمون واریانس یک نمونه آماری از این پیکیج استفاده می شود
install.packages("EnvStats")
library("EnvStats")


data <- read.table("PlstCase.dat", header = T)
data
var(data$size)


## آزمون فرضیه دو طرفه است  
# H0: sigma^2 = 2.4*10^-6                      # فرض صفر
# H1: sigma^2 # 2.4*10^-6                      # فرض مقابل
#p-value < 0.05 reject null hypothesis         # رد فرضیه

# varTest : To test sampele for var

varTest(data$size, alternative = "two.sided", conf.level = 0.95, sigma.squared = 2.4*10^-6)

# نتيجه
# با توجه به مقدار پي ولي که بزرگ تر از پنج صدم است
# نميتوانيم فرض صفر را رد کنيم و مقدار واريانس جامعه صحيح است
## H0: sigma^2 = 2.4*10^-6 : TRUE

